Revit 2027 API
UV.AngleTo Method
Returns the angle between this vector and the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AngleTo(
	UV source
)
Public Function AngleTo (
	source As UV
) As Double
public:
double AngleTo(
	UV^ source
)
member AngleTo :
        source : UV -> float
Parameters
source UV
The specified vector.
Return Value
Double
The real number between 0 and 2*PI equal to the angle between the two vectors in radians.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The angle is measured counterclockwise.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace